; domain
(define (domain Depot)
;(:requirements :typing :fluents)
(:types place locatable - object
		depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place) 
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface)
)

(:functions 
	(load_limit ?t - truck) 
	(current_load ?t - truck) 
	(weight ?c - crate)
	(fuel-cost)
)
	
(:action Drive
:parameters (?x - truck ?y - place ?z - place) 
:precondition (and (at ?x ?y))
:effect (and (not (at ?x ?y)) (at ?x ?z)
		(increase (fuel-cost) 10)))

(:action Lift
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
:effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) 
             (clear ?z) (not (on ?y ?z)) (increase (fuel-cost) 1)))

(:action Drop 
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
:effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)
		(on ?y ?z)))

(:action Load
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y)
		(<= (+ (current_load ?z) (weight ?y)) (load_limit ?z)))
:effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)
		(increase (current_load ?z) (weight ?y))))

(:action Unload 
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
:effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)
		(decrease (current_load ?z) (weight ?y))))

)

; problem
(define (problem depotprob67) (:domain depot)
(:objects
	depot0 - depot
	distributor0 distributor1 - distributor
	truck0 truck1 - truck
	pallet0 pallet1 pallet2 - pallet
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 crate7 - crate
	hoist0 hoist1 hoist2 - hoist)
(:init
	(at pallet0 depot0)
	(clear crate5)
	(at pallet1 distributor0)
	(clear crate7)
	(at pallet2 distributor1)
	(clear pallet2)
	(at truck0 distributor0)
	(= (current_load truck0) 0)
	(= (load_limit truck0) 299)
	(at truck1 distributor0)
	(= (current_load truck1) 0)
	(= (load_limit truck1) 285)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 distributor0)
	(available hoist1)
	(at hoist2 distributor1)
	(available hoist2)
	(at crate0 distributor0)
	(on crate0 pallet1)
	(= (weight crate0) 80)
	(at crate1 distributor0)
	(on crate1 crate0)
	(= (weight crate1) 45)
	(at crate2 distributor0)
	(on crate2 crate1)
	(= (weight crate2) 60)
	(at crate3 depot0)
	(on crate3 pallet0)
	(= (weight crate3) 16)
	(at crate4 distributor0)
	(on crate4 crate2)
	(= (weight crate4) 56)
	(at crate5 depot0)
	(on crate5 crate3)
	(= (weight crate5) 50)
	(at crate6 distributor0)
	(on crate6 crate4)
	(= (weight crate6) 17)
	(at crate7 distributor0)
	(on crate7 crate6)
	(= (weight crate7) 34)
	(= (fuel-cost) 0)
)

(:goal (and
		(on crate0 crate5)
		(on crate2 pallet1)
		(on crate3 crate7)
		(on crate4 crate3)
		(on crate5 crate6)
		(on crate6 pallet0)
		(on crate7 crate2)
	)
)

(:metric minimize (total-time)))

; plan
1. (lift hoist1 crate7 crate6 distributor0)
   deleted: (at crate7 distributor0) (clear crate7) (available hoist1) (on crate7 crate6)
   added: (lifting hoist1 crate7) (clear crate6)
   changed: (fuel-cost) from 0 to 1
   goals met: 0 of 7
2. (load hoist1 crate7 truck0 distributor0)
   deleted: (lifting hoist1 crate7)
   added: (in crate7 truck0) (available hoist1)
   changed: (current_load truck0) from 0 to 34
   goals met: 0 of 7
3. (lift hoist1 crate6 crate4 distributor0)
   deleted: (at crate6 distributor0) (clear crate6) (available hoist1) (on crate6 crate4)
   added: (lifting hoist1 crate6) (clear crate4)
   changed: (fuel-cost) from 1 to 2
   goals met: 0 of 7
4. (load hoist1 crate6 truck0 distributor0)
   deleted: (lifting hoist1 crate6)
   added: (in crate6 truck0) (available hoist1)
   changed: (current_load truck0) from 34 to 51
   goals met: 0 of 7
5. (lift hoist1 crate4 crate2 distributor0)
   deleted: (at crate4 distributor0) (clear crate4) (available hoist1) (on crate4 crate2)
   added: (lifting hoist1 crate4) (clear crate2)
   changed: (fuel-cost) from 2 to 3
   goals met: 0 of 7
6. (load hoist1 crate4 truck0 distributor0)
   deleted: (lifting hoist1 crate4)
   added: (in crate4 truck0) (available hoist1)
   changed: (current_load truck0) from 51 to 107
   goals met: 0 of 7
7. (lift hoist0 crate5 crate3 depot0)
   deleted: (at crate5 depot0) (clear crate5) (available hoist0) (on crate5 crate3)
   added: (lifting hoist0 crate5) (clear crate3)
   changed: (fuel-cost) from 3 to 4
   goals met: 0 of 7
8. (drive truck0 distributor0 depot0)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 4 to 14
   goals met: 0 of 7
9. (load hoist0 crate5 truck0 depot0)
   deleted: (lifting hoist0 crate5)
   added: (in crate5 truck0) (available hoist0)
   changed: (current_load truck0) from 107 to 157
   goals met: 0 of 7
10. (unload hoist0 crate6 truck0 depot0)
   deleted: (in crate6 truck0) (available hoist0)
   added: (lifting hoist0 crate6)
   changed: (current_load truck0) from 157 to 140
   goals met: 0 of 7
11. (lift hoist1 crate2 crate1 distributor0)
   deleted: (at crate2 distributor0) (clear crate2) (available hoist1) (on crate2 crate1)
   added: (lifting hoist1 crate2) (clear crate1)
   changed: (fuel-cost) from 14 to 15
   goals met: 0 of 7
12. (load hoist1 crate2 truck1 distributor0)
   deleted: (lifting hoist1 crate2)
   added: (in crate2 truck1) (available hoist1)
   changed: (current_load truck1) from 0 to 60
   goals met: 0 of 7
13. (lift hoist1 crate1 crate0 distributor0)
   deleted: (at crate1 distributor0) (clear crate1) (available hoist1) (on crate1 crate0)
   added: (lifting hoist1 crate1) (clear crate0)
   changed: (fuel-cost) from 15 to 16
   goals met: 0 of 7
14. (load hoist1 crate1 truck1 distributor0)
   deleted: (lifting hoist1 crate1)
   added: (in crate1 truck1) (available hoist1)
   changed: (current_load truck1) from 60 to 105
   goals met: 0 of 7
15. (drop hoist0 crate6 crate3 depot0)
   deleted: (lifting hoist0 crate6) (clear crate3)
   added: (available hoist0) (at crate6 depot0) (clear crate6) (on crate6 crate3)
   goals met: 0 of 7
16. (lift hoist1 crate0 pallet1 distributor0)
   deleted: (at crate0 distributor0) (clear crate0) (available hoist1) (on crate0 pallet1)
   added: (lifting hoist1 crate0) (clear pallet1)
   changed: (fuel-cost) from 16 to 17
   goals met: 0 of 7
17. (load hoist1 crate0 truck1 distributor0)
   deleted: (lifting hoist1 crate0)
   added: (in crate0 truck1) (available hoist1)
   changed: (current_load truck1) from 105 to 185
   goals met: 0 of 7
18. (unload hoist1 crate2 truck1 distributor0)
   deleted: (in crate2 truck1) (available hoist1)
   added: (lifting hoist1 crate2)
   changed: (current_load truck1) from 185 to 125
   goals met: 0 of 7
19. (drive truck1 distributor0 depot0)
   deleted: (at truck1 distributor0)
   added: (at truck1 depot0)
   changed: (fuel-cost) from 17 to 27
   goals met: 0 of 7
20. (drop hoist1 crate2 pallet1 distributor0)
   deleted: (lifting hoist1 crate2) (clear pallet1)
   added: (available hoist1) (at crate2 distributor0) (clear crate2) (on crate2 pallet1)
   goals met: 1 of 7
21. (unload hoist0 crate5 truck0 depot0)
   deleted: (in crate5 truck0) (available hoist0)
   added: (lifting hoist0 crate5)
   changed: (current_load truck0) from 140 to 90
   goals met: 1 of 7
22. (drop hoist0 crate5 crate6 depot0)
   deleted: (lifting hoist0 crate5) (clear crate6)
   added: (available hoist0) (at crate5 depot0) (clear crate5) (on crate5 crate6)
   goals met: 2 of 7
23. (lift hoist0 crate5 crate6 depot0)
   deleted: (at crate5 depot0) (clear crate5) (available hoist0) (on crate5 crate6)
   added: (lifting hoist0 crate5) (clear crate6)
   changed: (fuel-cost) from 27 to 28
   goals met: 1 of 7
24. (load hoist0 crate5 truck1 depot0)
   deleted: (lifting hoist0 crate5)
   added: (in crate5 truck1) (available hoist0)
   changed: (current_load truck1) from 125 to 175
   goals met: 1 of 7
25. (lift hoist0 crate6 crate3 depot0)
   deleted: (at crate6 depot0) (clear crate6) (available hoist0) (on crate6 crate3)
   added: (lifting hoist0 crate6) (clear crate3)
   changed: (fuel-cost) from 28 to 29
   goals met: 1 of 7
26. (load hoist0 crate6 truck1 depot0)
   deleted: (lifting hoist0 crate6)
   added: (in crate6 truck1) (available hoist0)
   changed: (current_load truck1) from 175 to 192
   goals met: 1 of 7
27. (lift hoist0 crate3 pallet0 depot0)
   deleted: (at crate3 depot0) (clear crate3) (available hoist0) (on crate3 pallet0)
   added: (lifting hoist0 crate3) (clear pallet0)
   changed: (fuel-cost) from 29 to 30
   goals met: 1 of 7
28. (load hoist0 crate3 truck0 depot0)
   deleted: (lifting hoist0 crate3)
   added: (in crate3 truck0) (available hoist0)
   changed: (current_load truck0) from 90 to 106
   goals met: 1 of 7
29. (drive truck0 depot0 distributor0)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 30 to 40
   goals met: 1 of 7
30. (unload hoist1 crate7 truck0 distributor0)
   deleted: (in crate7 truck0) (available hoist1)
   added: (lifting hoist1 crate7)
   changed: (current_load truck0) from 106 to 72
   goals met: 1 of 7
31. (drop hoist1 crate7 crate2 distributor0)
   deleted: (lifting hoist1 crate7) (clear crate2)
   added: (available hoist1) (at crate7 distributor0) (clear crate7) (on crate7 crate2)
   goals met: 2 of 7
32. (unload hoist1 crate3 truck0 distributor0)
   deleted: (in crate3 truck0) (available hoist1)
   added: (lifting hoist1 crate3)
   changed: (current_load truck0) from 72 to 56
   goals met: 2 of 7
33. (drop hoist1 crate3 crate7 distributor0)
   deleted: (lifting hoist1 crate3) (clear crate7)
   added: (available hoist1) (at crate3 distributor0) (clear crate3) (on crate3 crate7)
   goals met: 3 of 7
34. (unload hoist1 crate4 truck0 distributor0)
   deleted: (in crate4 truck0) (available hoist1)
   added: (lifting hoist1 crate4)
   changed: (current_load truck0) from 56 to 0
   goals met: 3 of 7
35. (drop hoist1 crate4 crate3 distributor0)
   deleted: (lifting hoist1 crate4) (clear crate3)
   added: (available hoist1) (at crate4 distributor0) (clear crate4) (on crate4 crate3)
   goals met: 4 of 7
36. (unload hoist0 crate6 truck1 depot0)
   deleted: (in crate6 truck1) (available hoist0)
   added: (lifting hoist0 crate6)
   changed: (current_load truck1) from 192 to 175
   goals met: 4 of 7
37. (drop hoist0 crate6 pallet0 depot0)
   deleted: (lifting hoist0 crate6) (clear pallet0)
   added: (available hoist0) (at crate6 depot0) (clear crate6) (on crate6 pallet0)
   goals met: 5 of 7
38. (unload hoist0 crate5 truck1 depot0)
   deleted: (in crate5 truck1) (available hoist0)
   added: (lifting hoist0 crate5)
   changed: (current_load truck1) from 175 to 125
   goals met: 5 of 7
39. (drop hoist0 crate5 crate6 depot0)
   deleted: (lifting hoist0 crate5) (clear crate6)
   added: (available hoist0) (at crate5 depot0) (clear crate5) (on crate5 crate6)
   goals met: 6 of 7
40. (unload hoist0 crate0 truck1 depot0)
   deleted: (in crate0 truck1) (available hoist0)
   added: (lifting hoist0 crate0)
   changed: (current_load truck1) from 125 to 45
   goals met: 6 of 7
41. (drop hoist0 crate0 crate5 depot0)
   deleted: (lifting hoist0 crate0) (clear crate5)
   added: (available hoist0) (at crate0 depot0) (clear crate0) (on crate0 crate5)
   goals met: 7 of 7
